[
  {
    "title": "Biology",
    "description": "Biology involves the study of a wide range of exciting topics, ranging from molecular biology to the study of ecosystems and from microorganisms to mammoths.  Biology is never far from the headlines either. The human genome has been sequenced and we know the complete arrangement of the three thousand million bases that make up human DNA.  In Kenya 350 people die every day from AIDS and in South East Asia the skies are dark with smoke as the last Bornean rainforests are burned to grow oil palms.  Biologists are concerned with all these issues.  They work in the fields of cell biology, medicine, food production and ecology ... and the work they do is vital to us all.",
    "Study": "In the first year, you will study the following topics: Biological molecules, Cells, Organisms exchange substances with their environment. Genetic information, variation and relationships between organisms. In the second year you will study the following topics: Energy transfers in and between organisms. Organisms respond to changes in their internal and external environments. Genetics, populations, evolution and ecosystems. The control of gene expression."
  },
  {
    "title": "Business",
    "description": "A Level Business is useful for a range of careers, as it is a subject which covers a wide variety of topics, including marketing and finance. It also gives you the opportunity to start using skills within the classroom straight into the working world be it a part-time job or your own business.",
    "Study": "You'll develop a range of skills covering the following subject areas; Marketing and people, Meeting customer needs, The market, Marketing mix and strategy, Managing people, Entrepreneurs and leaders, Managing business, Raising finance, Financial planning, Managing finance, Resource management,External influences, Business decisions and strategy, Business objectives and strategy, Business growth, Decision-making techniques, Influences on business decisions, Assessing competitiveness, Managing change, Global business, Globalisation, Global markets and business expansion, Global marketing, Global industries and companies (multinational corporations)."
  },
  {
    "title": "Chemistry",
    "description": "Chemistry is often termed the central science because of its important role in connecting many different fields and thus A level Chemistry is one of the most highly regarded subjects that you have the option of choosing. It is a subject well suited to able students with a keen interest in science as it contains a fascinating and highly challenging mix of topics that require and develop a variety of skills that are valued in many health-related and industrial sectors.",
    "Study": "The course consists of topics covering four of the main branches: organic, inorganic, physical and analytical chemistry which you study over two years. The first year expands on base knowledge from GCSE level such as kinetics and bonding whilst introducing new concepts such as detailing the exact mechanisms of reactions that take place on the molecular level. The second year begins to look at the question of why reactions only happen under certain conditions by introducing thermodynamics, the properties of transition metals and further reactions involving many more organic functional groups. Chemistry at A level is a very concise science with a fair amount of mathematical content and is a large step up from GCSE as the emphasis is much more on understanding and being able to answer the question 'why?' rather than simple recall."
  },
  {
    "title": "Computer Science",
    "description": "It is important to realise that there is a clear distinction between ICT and Computer Science/Computing. This course has an emphasis on abstract thinking, problem-solving, algorithmic and mathematical reasoning, and requires similar thought processes to science and engineering subjects. It is about designing new sequences of instructions (algorithms) to solve problems and is a good foundation for advanced logical reasoning. Many computing students choose to study this subject alongside Maths and Physics and this is a combination favoured by universities.",
    "Study": "You will study the following topic areas over the two-year course: Fundamentals of programming, Fundamentals of data structures, Fundamentals of algorithms, Theory of computation, Fundamentals of data representation, Fundamentals of computer systems, Fundamentals of computer organisation and architecture, Consequences of uses of computing, Fundamentals of communication and networking, Fundamentals of databases, Big Data, Fundamentals of functional programming, Systematic approach to problem solving, Non-exam assessment - the computing practical project"
  },
  {
    "title": "Criminology",
    "description": "Criminology is an increasingly popular subject for students who are interested in a career in criminal justice or studying criminology at university. The subject explores why people commit crime, drawing on explanations from psychology and sociology, along with how society tackles crime through the law, policing and punishment. Students learn about different types of crime, how people’s perceptions of crime are shaped and how crimes are investigated.",
    "Study": "Changing awareness of crime: types of crime, perceptions of crime and unreported crime. • Media representations of crime and of official data on crime. • Crime campaigns and their effectiveness. • Criminological theories: Why do people commit crime? Theories of criminality from biology, psychology and sociology. • Crime scene to Courtroom: the criminal justice system from investigation to verdict – personnel and techniques involved in criminal investigations and courtroom procedures. • Crime and Punishment: law making, criminal justice, forms and functions of punishment."
  },
  {
    "title": "Economics",
    "description": "Do you want to explore the relationship between an individual’s decisions and local economics? Or consider how economic policy makers can affect change on the national or global stage? You will find out about the terms, concepts, theories and models in both micro and macro Economics and learn how to evaluate the effects of economic agents for yourself. You will learn about markets and how they fail as well as studying both national and international economies including topics such as, competition; monopolies; the labour market; fiscal policy, government intervention, inequality and poverty and much more.",
    "Study": "Individuals, firms, markets and market failure. This area of study covers topics like:  individual economic decision making; production, costs and revenue; perfect competition, imperfectly competitive markets and monopoly; the labour market; the distribution of income and wealth: poverty and inequality; and the market mechanism, market failure and government intervention in markets.The national and international economy. This area of study covers topics like: the measurement of macroeconomic performance; how the macroeconomy works; the  circular flow of income, AD/AS analysis and related concepts; economic performance;financial markets and monetary policy; fiscalpolicy and supply-side policies; and the international economy."
  },
  {
    "title": "English Language",
    "description": "Are you curious about how language works? On the A Level English Language course you will learn how to analyse a range of different types of texts using a variety of linguistic methods. You will be equipped with your very own linguistic toolkit which will allow you to explore language in use and how language varies in different contexts.",
    "Study": "The topics you will study on the A Level English Language course include: Textual Variation and Representation Language and Gender, Language and Occupation, Language and Region, Language and, Social Groups, Language and Ethnicity, Child Language Acquisition, Language Change, World Englishes. In Year 2, you are also given the opportunity to independently investigate an area of language as part of your A Level Non-Exam Assessment."
  },
  {
    "title": "English Literature",
    "description": "If you enjoy reading, discussing ideas and writing critical essays you will find English Literature a stimulating and challenging course. It involves the study of a range of poetry, drama and prose texts, from the Elizabethan era right up to the present day. There will be theatre visits and other educational trips.",
    "Study": "Modules will include: Love Through the Ages. Your reading will include a range of prose, poetry and drama from the Elizabethan era to the present day. This will include close reading of a Shakespeare play, a novel and an anthology of poetry. Texts in Shared Contexts: Modern Times - Literature from 1945 to Present Day. Students study three texts, including one prose, one poetry and one drama, at least one of which must be written post-2000. Texts Across Time. This is the Non-Examined Assessment unit which requires you to write a comparative critical study of two texts by different authors, written at different times."
  },
  {
    "title": "Geography",
    "description": "Geographers study interactions between people and the environment and as such the course combines elements from the humanities and sciences. The Eduqas specification used here at Wakefield College deals with real-life challenges such as changing climates, piracy and smuggling, migration crises and geopolitical conflicts, as well as traditional topics such as coastal processes and tectonic hazards. The course includes fieldwork in the local areas as well as further afield to places such as the Yorkshire coast, Sheffield and Manchester.",
    "Study": "Coasts, Changing Places, Water and Carbon Cycles, Migration and Ocean governances, 21st Century Challenges, Tectonic Hazards, Weather and Climate, Independent Investigation: A non-examined project on a geographical topic of your choice, based on primary and secondary data collection."
  },
  {
    "title": "History",
    "description": "This course will allow you to study the history of the Cold War 1945-91 and Tudors 1485-1603 in great detail. It will also develop your ability to think critically, analyse the nature of historical events, discuss and debate from an informed standpoint and conduct independent research, providing you with a wide range of skills that will aid many careers from journalism, research, education, law and management.",
    "Study": "Tudors: England, 1485–1603This option allows students to study in breadth issues of change, continuity, cause and consequence in this period through the following key questions: How effectively did the Tudors restore and develop the powers of the monarchy? To what extent and why was power more widely shared during this period? Why were there so many changes to the Church and religious practice?How serious a threat was posed to Tudor monarchs by opposition and rebellion? How far and why were England’s relations with foreign powers changed? How important was the role of key individuals and groups and how were they affected by developments? Was Henry VII a genius king who created a dynasty his lazy son Henry VIII nearly lost?"
  },
  {
    "title": "Law",
    "description": "One of the most popular subjects in Wakefield College Sixth Form, the study of Law will provide you with the analytical and problem-solving skills needed to succeed in Higher Education or Employment. Our Learning Resource Centre and well-equipped teaching rooms provide the support you need to get the most out of this subject. Our teaching staff have many years' experience of delivering this very specialised subject. You will also have the opportunity to visit local courts as well as participating in a programme of guest lectures, from legal specialists such as working magistrates, solicitors, the police and university law departments.",
    "Study": "This course will enable you to develop an understanding of the principles of English Law and the structure of major aspects of the English Legal System. You will investigate how Law is made and the role of judges, juries and the legal profession. You will learn about aspects of criminal law, for example offences against the person, the law of homicide and the various property crimes. You will also study aspects of civil law including the law of tort (Negligence and Nuisance claims) and Human Rights. Finally, you will study some of the more philosophical elements of the subject such as the relationship between law, morality and justice."
  },
  {
    "title": "Mathematics",
    "description": "If you enjoy Maths and feel confident with the work you have met so far at GCSE, then you should consider Maths A Level. It is a demanding and challenging subject, but it can be an extremely rewarding one if you are prepared to put in time and effort. In return you will gain one of the most useful of all the A Levels which can open the door to many degree courses and occupations.",
    "Study": "A Level Maths is divided into two areas; Core and Applied. Core Maths builds upon your knowledge from GCSE in topics such as Algebra, Coordinate Geometry, and Trigonometry. It also introduces many new areas such as Calculus (Differentiation and Integration), and Series. Applied Maths is all about Maths in the real world, which includes Mechanics and Statistics. Some of the topics covered include Newton’s Second Law, Kinematics, Linear Regression, and Probability. All of these areas combine to make up A Level Mathematics. There is also the option for exceptional mathematicians to study Further Maths, which is also divided into Core and Applied. Core Further Maths includes topics on Complex Numbers and Matrices, while the Applied section introduces Decision Maths, a relatively new area of Maths concerning Algorithms and Processes."
  },
  {
    "title": "Media Studies",
    "description": "Media Studies is a creative, practical and theoretical course, in which you will explore a wide range of media texts, audiences and media institutions. The course aims to enhance your enjoyment and appreciation of the media and its role in your everyday life. It also aims to develop your critical understanding of the media through engagement with a wide range of broadcast, print and E-Media texts. You will also have the opportunity to create your own production pieces as part of your coursework. This course offers great opportunity for educational visits such as the Bradford Media Museum and Media City.",
    "Study": "The Eduqas specification offers learners the opportunity to develop a thorough and in depth understanding of key issues, using a comprehensive theoretical framework and a variety of advanced theoretical approaches and theories to support critical exploration and reflection, analysis and debate. The study of a wide range of rich and stimulating media products is central to the specification, offering opportunities for detailed analysis of how the media communicate meanings in a variety of forms. Learners will work from the product outwards to debate key critical questions related to the social, cultural, political and economic role of the media. Through studying media products holistically in relation to all areas of the theoretical framework, learners will engage with the dynamic relationships between media products, media industries and audiences. Learners will also consider established media forms alongside more contemporary forms, developing an awareness of emerging and evolving media."
  },
  {
    "title": "Photography",
    "description": "A Level Photography is a visually creative course where you learn new skills in both traditional and digital photography. Throughout the course we look at four main areas; darkroom, studio, location and digital manipulation and based entirely on course work students will have the opportunity to develop in these areas using their own ideas and imagination. The college has great facilities such as a fully working studio, lighting equipment, cameras and accessories, a darkroom and PC’s fully equipped with the latest editing software. It offers a range of activities that are set outside of the course work projects, from music photography to sports and event photography, which will help students gain experience and build a bigger and better portfolio of work. Students will also get the opportunity to come on various trips to see exhibitions and photograph on location, these include a visits to a wide range of galleries and an overnight stay in London. Although this is a course work based subject it is also demanding and students must have the ability and the motivation, using time within and outside of college to produce bodies of work that are of an excellent quality.",
    "Study": "This is a two-year course that focuses on 4 main areas of study (studio, darkroom, digital manipulation and location photography). Each area will be developed into individual projects based around subjects such as portraiture or landscape photography. The course is split into three main components: Portfolio building. This will concentrate on learning, understanding and practising the skills needed throughout the course, whilst producing a variety of independent projects. Personal Investigation. This entails students developing skills in all areas as well as appreciating and learning about historical and contemporary photographers. Work will be underpinned with research and written analysis as well as a visual work which shows the learning process. Students will then be given the opportunity to develop their own personal style of photography with individual projects. Sharing good practice within the class learners will push their abilities to the limit and produce a body of work that shows a journey of development resulting in a skilful and creative final outcome. Each learner will also produce a 3000 word essay, which is split into two parts, based on the work and photographers they have researched."
  },
  {
    "title": "Physics",
    "description": "Have you ever wondered why the air smells differently in a thunderstorm or when you throw a ball it flies in a curve? If you have an enquiring mind, this subject will give you a fascinating insight into how the physical world works and the part it plays in the functioning of our world and beyond.",
    "Study": "Year 1: Measurements and their errors. This will introduce and consolidate the use and manipulation of SI units to include conversions and dimensional analysis. Errors will be determined and evaluated in absolute, fractional and percentage terms as well as graphically. Particles, Quantum Phenomena and Electricity. An introduction to the fundamental properties and nature of matter, radiation and quantum phenomena. You will also study electricity and its Applications, building on principles acquired at GCSE. Mechanics, Materials and Waves. This introduces vectors and develops knowledge and understanding of forces and energy from GCSE Additional Science. Materials are studied in terms of their bulk properties and tensile strength and. You will also gain an in-depth knowledge of the characteristics, properties and applications of waves. Year 2: Fields and their Consequences and Nuclear Physics. The section covers electric and magnetic fields, together with basic electromagnetic induction. The nuclear section looks at the characteristics of the nucleus, the properties of unstable nuclei and how energy is obtained from the nucleus. Further Mechanics and Thermal Physics. This advances the study of motion, introduces circular and oscillatory motion and gravitation. Electric fields and magnetic fields are also studied. The thermal properties of materials and the nature of gases are studied in depth."
  },
  {
    "title": "Politics",
    "description": "This course will allow you to study not only the UK political system of government, but also the system of government within the United States, making comparisons between the two.  Alongside this, you will also study the core ideologies that define political thought, such as Liberalism to Conservatism and Socialism to Nationalism. This study with not only increase your knowledge of political systems, but it will also develop your ability to think critically, analyse the nature of government, discuss and debate from an informed standpoint and conduct independent research.  This will provide you with a wide range of skills that will aid many careers such those in politics and the civil service, journalism, research, education, law and management. ",
    "Study": "This will give you a broad understanding of; The British Constitution and how it came about, The structure and role of Parliament, The role and accountability and the Prime Minster and their Cabinet, The Judiciary, Devolution – the Scottish Parliament, Welsh Assembly and the Northern Ireland Assembly, Political Parties, Democracy, Elections and Referendums, Pressure Groups, The EU. US Politics: This unit will develop your understanding of international politics by studying the constitution of the USA and comparing it with that of the UK.  You will do this by evaluating; Congress, The powers of the President, The judicial branch of government, The electoral process and democracy, Political parties, Pressure groups, Civil Rights. Political Ideas: This unit is your chance really evaluate and understand that core ideas and concepts that govern political thinking. These core ideologies include; Liberalism, Conservatism, Socialism, Nationalism, Feminism, Multiculturalism, Anarchism, Ecologism"
  },
  {
    "title": "Psychology",
    "description": "Psychology is a popular and fascinating subject that seeks to explain human thoughts, cognition and behaviour. It explores various explanations for understanding human behaviour more explicitly and attempts to analyse why we act in the way we do through scientific method. For instance, why do some people develop mental illnesses? How do early relationships with our parents form the basis for future relationships? Why are some people willing to inflict pain on others when instructed to do so by an authority figure? If you enjoy analytical thinking and debate with an element of maths and science then this is the subject for you.",
    "Study": "In the first year you'll develop an understanding of Research Methods concepts and develop a broad knowledge of some of the key ideas that underpin the discipline. The topics you will study in your 1st year are: Paper 1: Introductory topics in psychology- Social Influence, Memory, Attachment and Psychopathology. Paper 2: Psychology in context- Research methods, Approaches in psychology Bio psychology. In your second year you will apply your knowledge to study a further five topics including: Paper 1: Localisation and Plasticity of the Brain. Paper 2: Issues and options in psychology- Issues and debates, Gender, Schizophrenia and Forensic Psychology."
  },
  {
    "title": "Sociology",
    "description": "Sociology is the study of how social forces shape and mould human behaviour, usually without our consent or acknowledgement. It’s an ever-changing subject area that makes you question how the world works and often shines the spotlight on many different forms of inequality that exist in our world today. Approach it with an open mind and you may find yourself totally immersed in a very short space of time.",
    "Study": "The full A level is split into four units which will be taught over two years. The first year is split into two units which cover the following: 1) Education with Theory and Methods. In this module you will study the role of education in today’s society from a theoretical perspective which may make you think about your own experiences in a different way. You will also study how the education system has evolved from its origin in 1880 to its present state and the factors that affect educational achievement in different social groups. This module is a student favourite and always generates a response. You will also learn about the different types of research methods Sociologists use. 2) Family and Households. The second part of the module focuses on families and households. This module looks at how influential the family unit can be on the development of the individual. This fairly varied module starts by looking at how different theoretical perspectives view the family and then progresses to look at more controversial themes such as domestic violence, divorce and family diversity. 3) Beliefs in Society. This module analyses the impact that religion has on society from both theoretical and real life perspectives. From the study of traditional religions to New Religious Movements, you will gain a contemporary understanding of the role of religion today and how it shapes and moulds our individual experiences. This is a vastly under-rated module that quite often becomes a favourite of many students by the end of the course. 4) Crime and Deviance with Theory and Methods. Starting with the views of theoretical perspectives as a foundation, students will then cover themes such as corporate, state and environmental crime, institutional racism within the police and the 'Chivalry Thesis' which never fail to engage. The module also includes a synoptic element in which your knowledge of theory and methods from the whole A-level will be assessed."
  },
  {
    "title": "19",
    "description": "19",
    "Study": "19"
  },
  {
    "title": "20",
    "description": "20",
    "Study": "20"
  }
]
